# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [5]:
import pandas as pd
import numpy as np

In [3]:
#df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [8]:
index='A B C D E'

In [10]:
index.split()

['A', 'B', 'C', 'D', 'E']

In [48]:
df = pd.DataFrame(np.random.randn(5,4),index=['A', 'B', 'C', 'D', 'E'],columns='W X Y Z'.split())

In [16]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [20]:
df['Z']

A    0.485809
B    1.541990
C    1.407338
D    1.028293
E   -1.223082
Name: Z, dtype: float64

In [21]:
# Pass a list of column names
df[['W','X']]

          W         X
A -1.467514 -0.494095
B  0.392489  0.221491
C  0.666319 -0.538235
D  0.641806 -0.905100
E -1.972605 -0.866885

In [22]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

DataFrame Columns are just Series

In [24]:
type(df["W"])

pandas.core.series.Series

**Creating a new column:**

In [49]:
df['new'] = df['W'] - df['Y']

In [50]:
df

          W         X         Y         Z       new
A  0.586847 -1.621348  0.677535  0.026105 -0.090688
B -1.678284  0.333973 -0.532471  2.117727 -1.145813
C  0.197524  2.302987  0.729024 -0.863091 -0.531500
D  0.305632  0.243178  0.864165 -1.560931 -0.558533
E -0.251897 -0.578120  0.236996  0.200780 -0.488893

In [45]:
df.drop("W",axis=1,inplace=True)

In [46]:
df

          X         Y         Z       new
A -1.115710 -1.385379 -1.329660  0.221401
B -0.411055 -0.771329  0.110477 -0.729869
C  0.253548  0.649148  0.358941 -0.155504
D  0.902398  0.161781  0.833029 -0.918690
E -0.388239  0.783316 -0.708954  1.759036

** Removing Columns**

In [30]:
df.drop('X',axis=1,inplace = True)

In [194]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [195]:
df.drop('new',axis=1,inplace=True)

In [196]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Can also drop rows this way:

In [51]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A  0.586847 -1.621348  0.677535  0.026105 -0.090688
B -1.678284  0.333973 -0.532471  2.117727 -1.145813
C  0.197524  2.302987  0.729024 -0.863091 -0.531500
D  0.305632  0.243178  0.864165 -1.560931 -0.558533

** Selecting Rows**

In [52]:
df.loc['A']

W      0.586847
X     -1.621348
Y      0.677535
Z      0.026105
new   -0.090688
Name: A, dtype: float64

In [54]:
df

          W         X         Y         Z       new
A  0.586847 -1.621348  0.677535  0.026105 -0.090688
B -1.678284  0.333973 -0.532471  2.117727 -1.145813
C  0.197524  2.302987  0.729024 -0.863091 -0.531500
D  0.305632  0.243178  0.864165 -1.560931 -0.558533
E -0.251897 -0.578120  0.236996  0.200780 -0.488893

Or select based off of position instead of label

In [53]:
df.iloc[2]

W      0.197524
X      2.302987
Y      0.729024
Z     -0.863091
new   -0.531500
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [55]:
df.loc['B','Y']

-0.5324705255224986

In [56]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.586847  0.677535
B -1.678284 -0.532471

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [57]:
df

          W         X         Y         Z       new
A  0.586847 -1.621348  0.677535  0.026105 -0.090688
B -1.678284  0.333973 -0.532471  2.117727 -1.145813
C  0.197524  2.302987  0.729024 -0.863091 -0.531500
D  0.305632  0.243178  0.864165 -1.560931 -0.558533
E -0.251897 -0.578120  0.236996  0.200780 -0.488893

In [58]:
df>0

       W      X      Y      Z    new
A   True  False   True   True  False
B  False   True  False   True  False
C   True   True   True  False  False
D   True   True   True  False  False
E  False  False   True   True  False

In [204]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df[df['W']<0]

          W         X         Y         Z       new
B -1.678284  0.333973 -0.532471  2.117727 -1.145813
E -0.251897 -0.578120  0.236996  0.200780 -0.488893

In [61]:
df[df['W']>0]['Y']

A    0.677535
C    0.729024
D    0.864165
Name: Y, dtype: float64

In [62]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.677535 -1.621348
C  0.729024  2.302987
D  0.864165  0.243178

For two conditions you can use | and & with parenthesis:

In [64]:
df[(df['W']>0) & (df['Y'] > 0)]

          W         X         Y         Z       new
A  0.586847 -1.621348  0.677535  0.026105 -0.090688
C  0.197524  2.302987  0.729024 -0.863091 -0.531500
D  0.305632  0.243178  0.864165 -1.560931 -0.558533

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [65]:
df

          W         X         Y         Z       new
A  0.586847 -1.621348  0.677535  0.026105 -0.090688
B -1.678284  0.333973 -0.532471  2.117727 -1.145813
C  0.197524  2.302987  0.729024 -0.863091 -0.531500
D  0.305632  0.243178  0.864165 -1.560931 -0.558533
E -0.251897 -0.578120  0.236996  0.200780 -0.488893

In [71]:
# Reset to default 0,1...n index
df.reset_index(inplace =True)

In [72]:
newind = 'CA NY WY OR CO'.split()

In [73]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [74]:
df['States'] = newind

In [75]:
df

  index         W         X         Y         Z       new States
0     A  0.586847 -1.621348  0.677535  0.026105 -0.090688     CA
1     B -1.678284  0.333973 -0.532471  2.117727 -1.145813     NY
2     C  0.197524  2.302987  0.729024 -0.863091 -0.531500     WY
3     D  0.305632  0.243178  0.864165 -1.560931 -0.558533     OR
4     E -0.251897 -0.578120  0.236996  0.200780 -0.488893     CO

In [79]:
df = df.set_index('States')

KeyError: "None of ['States'] are in the columns"

In [78]:
df

       index         W         X         Y         Z       new
States
CA         A  0.586847 -1.621348  0.677535  0.026105 -0.090688
NY         B -1.678284  0.333973 -0.532471  2.117727 -1.145813
WY         C  0.197524  2.302987  0.729024 -0.863091 -0.531500
OR         D  0.305632  0.243178  0.864165 -1.560931 -0.558533
CO         E -0.251897 -0.578120  0.236996  0.200780 -0.488893

In [215]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [216]:
df.set_index('States',inplace=True)

In [218]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Great Job!